{
	"entries":[
		{
		"date":"04/14/2015",
		"title":"My Second Day",
		"text":"I don't know what day was more confusing, yesterday (my first day) or today (my second day). But I feel like I am learning<br/>regardless of whether I want to bang my head on the table with force. </br>  Today I, (we) learned boolean operators, which is applying<br/>logic statements to Python, and string Formatting (which is very important, especially when it comes to syntax).We touched upon<br/>if/else statements.  I'm a little frightened of the lists, as there is a lot to remember.  We also wrote code for a dice game that<br/>we wrote rules for, although we did not finish this program, I felt it a little daunting and it seemed like it's going over my head.<br/>Our all on your own lab consisted of arrays and arranging the integers so that they came out true or if asked to, came out false. <br/>I also feel like I have to do some personal work in order to \"catch up\" with the others around here, I feel like an anchor at sea. <br/>Hopefully, like I wrote yesterday, this feeling of inadequacy and confusion will eventually wash away."
		},
		{
		"date":"04/15/2015",
		"title":"Third Day",
		"text":"Today was my third day at dev code bootcamp. I honestly feel better than yesterday and the day before,<br/>my first day.  </br> I still think that there is a lot of work that I need to put in, and determination especially determination!. <br/>Today we worked on our third on your own lab, which consisted of arrays, making sure that the arrays were true, and also <br/>learning how to rotate the arrays so the numbers are in a certain order.  I can only hope that things go smoother from here on out." 
		},
		{"date":"04/16/2015",
		"title":"Fourth Day",
		"text": "Things are a bit clearer, but still as confusing as hell.  Today we went over our dice game, and applied loops; aka: the while function to our dice game so that we can continue to play our game after the first game. We also learned about loops. <br/> I was paired today with the strongest programmer in our class and found that I learn the best with people that know what I don't, which at this point is A LOT. I know that it/s good everyone/s learning if there is a teacher/pupil model. I am still VERY lost at this and I continue to have this sinking feeling that I may not be cut out for computer programming.  Will Time tell?  That is the ultimate question at this point."
		},
		{
		"date": "4/17/2015",
		"title": "Fifth Day",
		"text": "Today was certainly the best day of the week.  I had a little pow wow with myself last night and realized that the way to truly understand python is to sit there, no matter how long it takes, and figure it out.  Google, ask friends that have programming experience, watch videos, etc.  The learning method for computer programming is very unique, and being a person that comes from a typical classroom environment, this learning process will take some getting used to.  I am behind in the class, and I have to be fine with that.  I have to sit down by myself, especially this weekend and bang my head against the wall until I start to understand this and catch up."
		},
		{"date": "4/20/15",
		"title": "Sixth Day",
		"text" :  "Absolutely the best day I've had so far.  I have to remind myself that this is like learning a foreign language, and that it's impossible to pick it up as if it were a simple hobby.  Today we were delegated two projects, a personal one and a team based project.  The personal project is one that I am developing for my 4 year old son; it's a story masher.  For clarification sake, what my program will, hopefully, do is take two stories: Star Wars and Teeenage Mutant Ninja Turtles and mash them into one story, or universe if you will.  So, my son will give me a hero from both stories and a villain from both stories, these characters will be entwined into each others respective story, meaning that I will have to replace character names.  The second project, our group project is a project that will find the trending hashtags on twitter in four major metropolitan areas, S.F., LA, Chicago, NY, and have those hashtags analysed.  And then we can turn around with the analysis that we have gleaned, and use those numbers to create our own trending hashtag.  I am still pretty confused and green, but with enough time and patience, one can learn almost anything.  It has to get better from here, right?"   
		},
		{"date": "4/21/15",
		"title": "Seventh Day",
		"text" : "Wow! I wrote my first program, albeit VERY slowly and with tons of help, but I did it regardless.  It took me all day to complete, but I kept my head up and went forward, even if I felt like giving up a few times; persistence is key.  I can NOT wait to sit down with my son and try this program with him. I think he'll be impressed.  I know I am impressed with myself!  I assume that computer coding is definitely an industry in which there are a lot of highs and lows, yet when the highs hit, they certainly hit!  Now, don't get me wrong.  Is there still a lot of work and understanding on my part to do? Yes. But everyday things become incrementally clearer. I hope this trend doesn't stop."	
		},
		{"date": "4/22/15",
		 "title": "Eighth Day",
		 "text" : "Well, the days keep getting better here.  I am really starting to get a good groove when it comes to python. the labs that are provided are challenging, but once I find out the solution to them, I not only feel jubilant, but confident in understanding how I got to that solution.  Learning computer programming is taking it step by step.  I think where my weakness in learning programming is trying to learn too much at once; I need to slow down and take it piecemeal. It is impossible to know everything, but it is not impossible to learn anything. Today was a great day for me, I am certainly making progress, and that feels great."
		},
		{"date": "4/23/15",
		 "title": "Ninth Day",
		 "text": "Today was a tough day for me.  When I went home last night I was filled with a sense of confidence and understanding with Python.  Upon entering the program this morning all of that confidence was eradicated, and the knowledge I thought I had was inapplicable.  After feeling lost and confused for most of the morning, I forced myself to tackle the things that frightened me, due to my ignorance with Python, and I have to say, it worked.  My method was not to look at the problem as a big problem, but as a series of small ones that just happen to make a large one.  I have to continue to remind myself that code is written line by line, and therefore learning it should be line by line. It's starting to become clearer to me, but it hasn't clicked yet, like it has for others.  I hope it clicks soon."
		},
		{"date": "4/24/15",
		 "title": "Tenth Day",
		 "text": "Today I presented my personal project, which is a story masher for my four year old son.  Essentially it takes stories from two universes; Star Wars and Teenage Mutant Ninja Turtles, and takes the main characters (the heroes and villains) and mashes them together so that they can coexist in the same universe.  Right now my project is functional, but it is not where I want it to be, so I need to tweak some things in order for it to be ideal.  I was very nervous when presenting, mainly because I have never presented on a computer program before, much less one that I wrote!  However, after I completed my presentation I realized just how far I have come within these two weeks.  The things that I am understanding and doing today, are things that would have been out of my league two weeks ago.  So progress is definitely being made, whether I feel it sometimes or not; progress is being made.  Our group project went well.  We designed a program to track the most popular hash tags in twitter from 4 major cities: LA, Chicago, SF, and NYC.  We then analysed that data and put that data into a few pie charts, it was definitely cool to see the finished product.  I feel that not only has my confidence increased in programming these last two weeks, but my feeling of being frightened by the material has abated as well. I am excited to see what lays in store for me next."
		},
		{"date": "4/27/15",
		 "title": "Eleventh Day",
		 "text": "With a lot of help from others, I was finally able to finish my personal project to my ideal vision.  I parsed the text files so that it only prints 200 words of the story now, instead of the whole story at once.  This amendment to my personal program took me 6 hours.  I think that to a trained programmer, that would have taken them about 10 minutes max. We had a coding challenge in which we constructed the high/low game from scratch.  I think I was the only one in my class that did NOT finish the project.  I think that at this juncture of the program I should be able to write that game in about a half hour, but where I'm at in my personal experience level, I would be lucky to even create finish a game like that, much less in a half hour.  My skill level is certainly the lowest of the class and it shows, quite clearly.  One thing to note about the high/low game is that when I write it out, in english, I actually have the game.  However, when I sit down to translate that pseudo code to python, I can't.  I just can't.  Perhaps this isn't for me."
		},
		{"date": "4/28/15",
		 "title": "Twelfth Day",
		 "text": "Today was my python evaluation and I passed.  Yes, I am just as surprised as you are.  Or, maybe I'm not.  I went in there, was asked some technical questions about Python, stood there and thought for a bit, and then information that I believe was latent and buried deep in my mind started to come forth and I was finding myself applying what I have learned about in python to the questions being asked.  I couldn't believe it.  These past two weeks have been very challenging for me and it has put me in the position of self doubt in my abilities.  But I have to trust in myself; to trust that I am getting this, and that I have already applied what I have learned.  I can and will do this!  Never give up!"
		},
		{"date": "4/29/15",
		 "title": "Thirteenth Day",
		 "text": "Today, we had a crash course in HTML.  My experience with HTML so far has been a good one.  I find that I can read and write in HTML a lot easier than I ever did with Python.    I finished all 3 of my labs today, which is a first for me.  I also found that when I ran into an obstacle in HTML during my labs, it was easier to surmount the issues that I faced in HTML than with Python.  With that being said, I feel like the fundamental knowledge that I gleaned from the past two weeks with Python were being applied in my learning of HTML.   Does this mean that it gets easier?   This early stage of understanding HTML is exciting for me, and very promising for what JS/HTML has in store for me in the future.  "
		},
		{"date": "4/30/15",
		 "title": "Fourteenth Day",
		 "text": "The last day of April and the first day of learning Java Script.  I feel like my confidence level with programming is higher than it ever has been before.  The fundamentals that I learned in Python are beginning to come in handy, which makes JS a lot easier to understand the first time around.  I feel like I have a stronger command over the labs, and when I run into an issue with my labs, I tend to figure out the answer by myself, with little to no help from the instructors.  So here's to confidence; may it continue to grow!"
		},
		{"date": "5/1/15",
		 "title": "Fifteenth Day",
		 "text": "Happy May Day!  Today we finished up our labs, the last lab had me stumped, it dealt with dates.  I am still trying to wrap my head around that last lab, I think some homework is in store for me this weekend.  This has certainly been my best week since I began here, with out a doubt.  We had two coding challenges on multiple dimension arrays, and I finished both of them!  A big step from where I was two weeks ago.  I look forward to delving even deeper into the JS curriculum next week.  My fear with computer programming is beginning to be washed away by my confidence--- let this trend continue!"
		}

	]
} 